#ifndef __MODULE_DEF_TYPE_GUI_PACK_H__
#define __MODULE_DEF_TYPE_GUI_PACK_H__

#include <vcl>

#pragma push(1, pack)

//-----------------------------------------------------------------
//-----------------------------------------------------------------
//-----------------------------------------------------------------
//Тут определяем упаковки отправляемые из Gui в обработчик и обратно
/**/
const unsigned short MT_PACK_GUI_PARAM	        = 0x0001;
struct SPackGuiParam
{
	char value_str[100];
    bool value_bool;
    int value_int;
};
/**/
//-----------------------------------------------------------------

#pragma pop(pack)

//-----------------------------------------------------------------
//-----------------------------------------------------------------
//-----------------------------------------------------------------

#endif //__MODULE_DEF_TYPE_GUI_PACK_H__