#ifndef __MODULE_DEF_PARAMS_H__
#define __MODULE_DEF_PARAMS_H__

#include <vcl>

#include "ConfigXMLDefs.h"
#include <stdio.h>

//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
//Тут определяем основные свойства модуля
const bool  defModuleTypeInput      = false;                            //< Определения типа модуля (входной или нет)

const char  defModuleShortName[16]  = "Внешний модуль";	                //< Название модуля
const char	defModuleLongName[128]  = "Описание примера модуля";
                                                                        //< Расширенное описание модуля
const char	defModuleGroupName[128] = "Группа примера модуля";			//< Название группы модуля

//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
//Тут определяем основные параметры модуля
/**/
const char	defModuleSettingsName[64] = "Основные настройки";

enum
{
    MODULE_STR,
    MODULE_BOOL,
    MODULE_INT,
    MODULE_CNT
};

const SParam defaultSetting[MODULE_CNT] =
    {
        {"Строковые параметр",      "Строка"},
        {"Булевый параметр",		"false"},
        {"Числовой параметр",		"0"}
    };

//Тут определяем динамические параметры модуля
const char DEFAULT_NAME_OPTION[128] = "Фильтр";
enum
{
    OPTION_STR,
    OPTION_BOOL,
    OPTION_INT,
    OPTION_CNT
};

const SParam defaultOption[OPTION_CNT] =
    {
        {"Строковая опция",     "Строка"},
        {"Булевая опция",		"true"},
        {"Числовая опция",		"0"}
    };
/**/
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
    
#endif //__MODULE_DEF_PARAMS_H__
