//---------------------------------------------------------------------------

#include <vcl.h>
#pragma hdrstop

#include "SettingsForm.h"

#pragma package(smart_init)
#pragma link "CSPIN"
#pragma resource "*.dfm"
TFormSettings *FormSettings;

#include "IdentifyDefs.h"
#include "ModuleDefs.h"
//---------------------------------------------------------------------------
//Тут определяем #include

//---------------------------------------------------------------------------
__fastcall TFormSettings::TFormSettings(TComponent* Owner)
    : TForm(Owner)
{
    //--------------------------------------------------------------------------
    //Конструктор

    //--------------------------------------------------------------------------
}
__fastcall TFormSettings::~TFormSettings()
{
    //--------------------------------------------------------------------------
    //Деструктор

    //--------------------------------------------------------------------------
}
//---------------------------------------------------------------------------

